Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортСделокИзКВИК.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ИмпортСделокИзКВИК</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИмпорта</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипИсточника</Name>
					<Comment>1 - SQL-сервер, 2 - файл</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимИмпорта</Name>
					<Comment>1 - Только поиск расхождений, 2 - Поиск и устранение расхождений</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтображатьТолькоРасхождения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеСвойства</Name>
					<Comment>Служебное поле, не использовать для работы</Comment>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПараметров</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ИмпортСделокИзКВИК/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Функция ПолучитьДанныеИзФайла(Текст)
	
	Данные = Новый Массив;	
	
	Для НомерСтроки = 1 по Текст.КоличествоСтрок() Цикл
		
		МассивДанных = РаботаСоСтрокамиКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст.ПолучитьСтроку(НомерСтроки));
		Данные.Добавить(МассивДанных);
		
	КонецЦикла;
	
	Возврат Данные;
	
КонецФункции

&НаСервере
Процедура ЗаполнитьТаблицуНаФорме(ИмяТаблицы, ИмпортируемыеДанные)
	
	Если Не ИмпортируемыеДанные.Свойство(ИмяТаблицы) Или ТипЗнч(ИмпортируемыеДанные[ИмяТаблицы]) <> Тип("ТаблицаЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	КоличествоРасхождений = 0;
	
	Для Каждого СтрокаИмпортирумыеДанные Из ИмпортируемыеДанные[ИмяТаблицы] Цикл
		
		// заполним поля, которые отображаются на форме
		НоваяСтрокаТаблицы = ЭтаФорма[ИмяТаблицы].Добавить();
		
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаИмпортирумыеДанные);
		
		НоваяСтрокаТаблицы.ГиперссылкаРасхождения = ?(НоваяСтрокаТаблицы.ЕстьРасхождения Или ИмяТаблицы = "Сделки" И НоваяСтрокаТаблицы.ЕстьРасхожденияВДопСведениях, "Показать", "");
		
		// заполним поле "ВсеРеквизиты"
		ВсеРеквизиты = Новый Структура();
		
		Для каждого Колонка Из ИмпортируемыеДанные[ИмяТаблицы].Колонки Цикл
			ВсеРеквизиты.Вставить(Колонка.Имя, СтрокаИмпортирумыеДанные[Колонка.Имя]);
		КонецЦикла;
		
		НоваяСтрокаТаблицы.ВсеРеквизиты = ВсеРеквизиты;
		
		Если СтрокаИмпортирумыеДанные.ЕстьРасхождения Или ИмяТаблицы = "Сделки" И НоваяСтрокаТаблицы.ЕстьРасхожденияВДопСведениях Тогда
			КоличествоРасхождений = КоличествоРасхождений + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ОтображатьТолькоРасхождения Тогда
		Если КоличествоРасхождений > 0 Тогда
			Элементы["Страница" + ИмяТаблицы].Заголовок = Элементы["Страница" + ИмяТаблицы].Заголовок + " (" + КоличествоРасхождений + ")";
		КонецЕсли;
	Иначе
		Элементы["Страница" + ИмяТаблицы].Заголовок = Элементы["Страница" + ИмяТаблицы].Заголовок + " (" + КоличествоРасхождений + "/" + ЭтаФорма[ИмяТаблицы].Количество() + ")";
	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ИмпортироватьДанныеНаСервере(ФайлДанных = Неопределено)
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ТекстСообщения = Неопределено;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(
		ЭтаФорма.Объект, "ДатаИмпорта,Организация,СхемаДанных,РежимИмпорта,ТипИсточника");
	Механизм = ОбъектНаСервере.Метаданные().ПолноеИмя() + ".ИмпортироватьДанныеНаСервере";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДанныеДляСтатистики = Новый Структура("Сделки, ИсполненияОбязательствПоСделкам, БудущиеИсполненияОбязательствПоСделкам, СделкиРЕПО, СделкиРЕПО_2, СделкиСВалютой");
	
	ЭтаФорма.Сделки.Очистить();
	ЭтаФорма.СделкиРЕПО.Очистить();
	ЭтаФорма.БудущиеИсполненияОбязательствПоСделкам.Очистить();
	ЭтаФорма.СделкиСВалютой.Очистить();
	Объект.ДополнительныеСвойства.Удалить("Ошибки");
	
	Элементы.СтраницаСделки.Заголовок                                 = "Сделки";
	Элементы.СтраницаСделкиРЕПО.Заголовок                             = "Сделки РЕПО";
	Элементы.СтраницаБудущиеИсполненияОбязательствПоСделкам.Заголовок = "Будущие исполнения сделок";
	Элементы.СтраницаСделкиСВалютой.Заголовок                         = "Сделки с валютой";
	
	ИмпортируемыеДанные = ОбъектНаСервере.ИмпортироватьДанные(ФайлДанных, ДанныеДляСтатистики);
	
	Если ТипЗнч(ИмпортируемыеДанные) = Тип("Структура") Тогда
		ЗаполнитьТаблицуНаФорме("Сделки"                                , ИмпортируемыеДанные);
		ЗаполнитьТаблицуНаФорме("СделкиРЕПО"                            , ИмпортируемыеДанные);
		ЗаполнитьТаблицуНаФорме("БудущиеИсполненияОбязательствПоСделкам", ИмпортируемыеДанные);
		ЗаполнитьТаблицуНаФорме("СделкиСВалютой"                        , ИмпортируемыеДанные);
	КонецЕсли;
	
	Для Каждого ГруппаОбъектов Из ДанныеДляСтатистики Цикл
		Если Не ЗначениеЗаполнено(ГруппаОбъектов.Значение) Тогда
			ДанныеДляСтатистики.Удалить(ГруппаОбъектов.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеДляСтатистики.Количество() = 0 Тогда
		ДанныеДляСтатистики = Неопределено;
	КонецЕсли;
	
	ОбъектНаСервере.ОповеститьОбОшибках(ТекстСообщения);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, ДанныеДляСтатистики, ТекстСообщения);
	
	Если Объект.РежимИмпорта = 2 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Импорт данных завершен");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КомандаИмпортироватьЦенныеБумагиНаСервере()
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект");
	ТекстСообщения = Неопределено;
	
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтаФорма.Объект, "ДатаИмпорта,Организация");
	Механизм = ОбъектНаСервере.Метаданные().ПолноеИмя() + ".КомандаИмпортироватьЦенныеБумагиНаСервере";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(Механизм, ПараметрыВыполненияДляСбораСтатистики.Хранилище, ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДанныеДляСтатистики = Новый Структура("ЗагруженныеБумаги"); 
	
	ОбъектНаСервере.НайтиИЗагрузитьЦенныеБумаги(ДанныеДляСтатистики);
	
	Если Не ЗначениеЗаполнено(ДанныеДляСтатистики.ЗагруженныеБумаги) Тогда
		ДанныеДляСтатистики = Неопределено;	
	КонецЕсли;
	
	ОбъектНаСервере.ОповеститьОбОшибках(ТекстСообщения);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия,, ДанныеДляСтатистики, ТекстСообщения);
		
КонецПроцедуры

&НаСервере
Процедура СверитьСделкиСДаннымиКвиковТрейдеровНаСервере() 
	
	
	Если Объект.ДатаИмпорта < ДобавитьМесяц(ТекущаяДатаСеанса(), -1) Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данные QUIKов трейдеров хранятся один месяц. Измените дату сверки.",, "Объект.ДатаИмпорта");
		Возврат;
		
	КонецЕсли;	
		
	Результат.Очистить();
	
	ОбъектНаСервере = РеквизитФормыВЗначение("Объект"); 
	
	СтруктураРезультат = Новый Структура("ОтсутствуютУНас, ОтсутствуютУТрейдера", Новый Массив, Новый Массив);
	
	ОбъектНаСервере.СверитьСделкиСДаннымиКвиковТрейдеров(СтруктураРезультат);
				
	Если СтруктураРезультат.ОтсутствуютУНас.Количество() > 0 Тогда
		
		Результат.ДобавитьСтроку("Отсутствующие сделки:"); 
		
		Для Каждого ОписаниеСделки Из СтруктураРезультат.ОтсутствуютУНас Цикл 
			Результат.ДобавитьСтроку(ОписаниеСделки); 
		КонецЦикла;
			
	КонецЕсли; 
		
	Если СтруктураРезультат.ОтсутствуютУТрейдера.Количество() > 0 Тогда
		
		Результат.ДобавитьСтроку("Проверьте вывод данных из QUIKов трейдеров. Отсутствуют данные следующих сделок:"); 
		
		Для Каждого ОписаниеСделки Из СтруктураРезультат.ОтсутствуютУТрейдера Цикл 
			Результат.ДобавитьСтроку(ОписаниеСделки); 
		КонецЦикла;
		
	КонецЕсли;
	
	Если Результат.КоличествоСтрок() = 0 Тогда
		Результат.ДобавитьСтроку("Расхождения отсутствуют.");	
	КонецЕсли;
	
	ОбъектНаСервере.ОповеститьОбОшибках(Неопределено);
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	РаботаСФормами.УстановитьВерсиюДополнительногоОтчетаОбработки(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.ДатаИмпорта) Тогда
		Объект.ДатаИмпорта = ТекущаяДата();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Объект.Организация = ОбщегоНазначения.ЗначениеПараметраСеанса("ТекущаяОрганизация");
	КонецЕсли;
	
	Элементы.СхемаДанных.СписокВыбора.ЗагрузитьЗначения(РеквизитФормыВЗначение("Объект").ПолучитьСхемыИмпорта("SQL"));
	Элементы.СхемаДанныхCSV.СписокВыбора.ЗагрузитьЗначения(РеквизитФормыВЗначение("Объект").ПолучитьСхемыИмпорта("CSV"));
		
	Если Объект.ТипИсточника <> 1 И Объект.ТипИсточника <> 2 Тогда
		Объект.ТипИсточника = 1; // Сервер
	КонецЕсли;
	
	Если Объект.РежимИмпорта <> 1 И Объект.РежимИмпорта <> 2 Тогда
		Объект.РежимИмпорта = 1; // Только поиск расхождений
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ТипИсточникаПриИзменении(Неопределено);
	ДатаИмпортаПриИзменении(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура ТипИсточникаПриИзменении(Элемент)
	
	Элементы.СхемаДанных.Видимость    = (Объект.ТипИсточника = 1);
	Элементы.ИмяФайлаДанных.Видимость = (Объект.ТипИсточника = 2);
	Элементы.СхемаДанныхCSV.Видимость = (Объект.ТипИсточника = 2);
	Элементы.ДатаПараметров.Видимость = (Объект.ТипИсточника = 2);

	Если Объект.ТипИсточника = 1 Тогда
		
		Если Элементы.СхемаДанных.СписокВыбора.Количество() = 1 Тогда
			Объект.СхемаДанных = Элементы.СхемаДанных.СписокВыбора[0];	
		КонецЕсли;
			
	Иначе
		
		Объект.ДатаПараметров = Объект.ДатаИмпорта;	
		Объект.СхемаДанных = "";
		
	КонецЕсли;
	
	Объект.ИмяФайлаДанных = "";
	
КонецПроцедуры

&НаКлиенте
Процедура ИмяФайлаДанныхНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогФыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогФыбораФайла.Фильтр        = "Текст (*.txt)|*.txt"; 
	ДиалогФыбораФайла.ИндексФильтра = 0;
	
	Если ДиалогФыбораФайла.Выбрать() Тогда
		Объект.ИмяФайлаДанных = ДиалогФыбораФайла.ПолноеИмяФайла;
	Иначе
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортироватьДанные(Команда)
	
  	ОчиститьСообщения();
		
	Если Не ЭтаФорма.ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	ФайлДанных = Неопределено;
	
	Если Объект.ТипИсточника = 2 Тогда // сделки из файла 
		
		Если Не ЗначениеЗаполнено(Объект.ДатаПараметров) Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Укажите дату параметров",, "ДатаПараметров"); 
			Возврат;	
		КонецЕсли;
		
		Файл = Новый ТекстовыйДокумент;
		Файл.Прочитать(Объект.ИмяФайлаДанных);
		ФайлДанных = ПолучитьДанныеИзФайла(Файл);
		
	КонецЕсли;
	
	ИмпортироватьДанныеНаСервере(ФайлДанных);
	
КонецПроцедуры

&НаКлиенте
Процедура СделкиПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя = "СделкиГиперссылкаРасхождения" И (Элемент.ТекущиеДанные.ЕстьРасхождения Или Элемент.ТекущиеДанные.ЕстьРасхожденияВДопСведениях) Тогда
			ФормаРасхождений = ОткрытьФормуМодально("ВнешняяОбработка._ИмпортСделокИзКВИК.Форма.Расхождения",
				Новый Структура("ВсеРеквизиты", Элемент.ТекущиеДанные.ВсеРеквизиты));
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СделкиДокумент" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СделкиНовСчетДоверительногоУправления" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СделкиРЕПОПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя = "СделкиРЕПОГиперссылкаРасхождения" И Элемент.ТекущиеДанные.ЕстьРасхождения Тогда
			ФормаРасхождений = ОткрытьФормуМодально("ВнешняяОбработка._ИмпортСделокИзКВИК.Форма.Расхождения",
				Новый Структура("ВсеРеквизиты", Элемент.ТекущиеДанные.ВсеРеквизиты));
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СделкиРЕПОДокумент" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СделкиРЕПОНовСчетДоверительногоУправления" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура БудущиеИсполненияОбязательствПоСделкамПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя = "БудущиеИсполненияОбязательствПоСделкамГиперссылкаРасхождения" И Элемент.ТекущиеДанные.ЕстьРасхождения Тогда
			ФормаРасхождений = ОткрытьФормуМодально("ВнешняяОбработка._ИмпортСделокИзКВИК.Форма.Расхождения",
				Новый Структура("ВсеРеквизиты", Элемент.ТекущиеДанные.ВсеРеквизиты));
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "БудущиеИсполненияОбязательствПоСделкамДокумент" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "БудущиеИсполненияОбязательствПоСделкамНовОснование" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.НовОснование) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.НовОснование);
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "БудущиеИсполненияОбязательствПоСделкамНовСчетДоверительногоУправления" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура СделкиСВалютойПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущиеДанные <> Неопределено Тогда
		Если Элемент.ТекущийЭлемент.Имя = "СделкиСВалютойГиперссылкаРасхождения" И Элемент.ТекущиеДанные.ЕстьРасхождения Тогда
			ФормаРасхождений = ОткрытьФормуМодально("ВнешняяОбработка._ИмпортСделокИзКВИК.Форма.Расхождения",
				Новый Структура("ВсеРеквизиты", Элемент.ТекущиеДанные.ВсеРеквизиты));
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СделкиСВалютойДокумент" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.Документ) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.Документ);
		ИначеЕсли Элемент.ТекущийЭлемент.Имя = "СделкиСВалютойНовСчетДоверительногоУправления" И ЗначениеЗаполнено(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления) Тогда
			ОткрытьЗначение(Элемент.ТекущиеДанные.НовСчетДоверительногоУправления);
		КонецЕсли;
	КонецЕсли;
	
	Отказ = Истина;

КонецПроцедуры

&НаКлиенте
Процедура КомандаИмпортироватьЦенныеБумаги(Команда)
	
	КомандаИмпортироватьЦенныеБумагиНаСервере();
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Импорт ценных бумаг завершен.");
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	РаботаСФормами.ПриЗагрузкеДанныхИзНастроек(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура СверитьСделкиСДаннымиКвиковТрейдеров(Команда)
	
	СверитьСделкиСДаннымиКвиковТрейдеровНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИмпортаПриИзменении(Элемент)
	
	ТекДата = НачалоДня(ТекущаяДата());
	
	Если Объект.ДатаИмпорта > НачалоДня(ТекущаяДата()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата импорта [" + Формат(Объект.ДатаИмпорта, "ДФ=dd.MM.yyyy") + "] не может быть больше текущей даты",, "Объект.ДатаИмпорта");
		Объект.ДатаИмпорта = Текдата;
	КонецЕсли; 
	
	Если Объект.ТипИсточника = 2 Тогда
		Объект.ДатаПараметров = Объект.ДатаИмпорта;	
	КонецЕсли;
		
	ЭтаФорма.Элементы.ДекорацияАрхив.Видимость = (Объект.ТипИсточника = 1 И Объект.ДатаИмпорта < ТекДата); 
	ЭтаФорма.Элементы.ДатаПараметров.Видимость = (Объект.ТипИсточника = 2);
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаИмпорта1ПриИзменении(Элемент)
	
	ТекДата = НачалоДня(ТекущаяДата());
	
	Если Объект.ДатаИмпорта > НачалоДня(ТекущаяДата()) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Дата сверки [" + Формат(Объект.ДатаИмпорта, "ДФ=dd.MM.yyyy") + "] не может быть больше текущей даты",, "Объект.ДатаИмпорта");
		Объект.ДатаИмпорта = Текдата;
	КонецЕсли;
	
КонецПроцедуры
